ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ЗаявкаНаРасходованиеДенежныхСредств/ЗаявкаНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c97305dd-0349-4b67-ba20-a37c9742ec79">
  <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b7764898-a5c1-49bf-bb5d-ddd451de72ea">
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b8132ef2-6942-4bfe-bad3-e852d50e003a">
    <name>КтоЗаявил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f456272-13af-47af-92b3-5a7c7ec491d8">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="270f8088-8c38-4b2c-828e-14fbd42be8a5">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b03068ee-89fb-4b66-ba0f-79c064b55e68">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2cf5bb5b-7def-44af-a137-83d1aea1bd7c">
    <name>ЖелательнаяДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6127db0c-668a-4161-98e2-bdd9e927d2c1">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2fc2ab70-1374-4bfd-8dea-0442077a183e">
    <name>ХозяйственнаяОперацияПоЗарплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbdd7ef1-8534-429f-a83e-806de2e85c36">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="235e73b3-9b94-4f5d-b611-768e2580a5c4">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b92dbdc-71bd-4ce1-9655-ff16de5ff182">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8d0c39e-e0f3-4ec3-82b4-e50b2711f842">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="19c01b94-13ad-41bd-8c16-a6e3bb49f03d">
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0bce01ef-621b-4aa2-a600-60561a7c094a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="718bcec2-e224-4716-9a52-15a8b1b006f8">
    <name>ПриоритетОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22e19717-21ea-42a0-a57a-d4ed4385230e">
    <name>СверхЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="edcf097e-e3c6-445c-891e-51791b6491c9">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.ИТБК_/src/AccumulationRegisters/ДенежныеСредстваКВыплате/ДенежныеСредстваКВыплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="947d0be4-dc16-4cb8-bf78-d27b25ddf109">
  <name>ДенежныеСредстваКВыплате</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="314b8bfc-2705-4246-99f2-2fc4854f2d9b">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="6ee5bb88-0060-4002-b2e4-12de15f953a2">
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e2fcd7bb-85a5-4284-91f7-f0fb972c0a9b">
    <name>БанковскийСчетКасса</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.ИТБК_/src/InformationRegisters/НаличиеФайлов/НаличиеФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="060b2bb4-ca03-4da9-930f-7f91f6299a35">
  <name>НаличиеФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="394b1a1c-a7ae-41b7-a346-4bac99fa567d">
    <name>ЕстьФайлы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ccfe4e36-80b6-419f-8bb3-c1046203d023">
    <name>ОбъектСФайлами</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen.ИТБК_/src/InformationRegisters/СостоянияПоОбъектамУчетаЭДО/СостоянияПоОбъектамУчетаЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94cb8fd8-e78e-4367-870e-e56a7e5e245d">
  <name>СостоянияПоОбъектамУчетаЭДО</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="9eb44008-3db8-4c27-940d-149dfe89ffe0">
    <name>СостояниеЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="cb90bdf4-c492-45ef-b596-12109e8f7847">
    <name>ПредставлениеСостояния</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bb074754-23ca-4d93-98f1-533aec10d349">
    <name>СсылкаНаОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f53b3b31-9cd3-4a9b-b293-626b3a525d66">
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26caefe6-3e76-4d73-9387-208213b91b67">
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0eec1c7a-4e84-488a-a0de-5ddf74b27a9c">
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a52a5aca-aa86-429b-b461-dbd79e1dbe24">
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="955ac7a2-906a-4d2b-9be1-a41ee11cec54">
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств/СтатусыЗаявокНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="22eba3bf-759c-463a-bb08-f0d1b4910ac9">
  <name>СтатусыЗаявокНаРасходованиеДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="97bb9b6a-7fb1-4a97-a53b-783fb8e84c2d">
    <name>НеСогласована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fd602008-2753-4368-9638-8d3803d0e2b2">
    <name>Согласована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a2703597-0f89-452e-b22a-4a3c82f7b70d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7ede1cab-9143-42b4-9eb3-fd405c68c64c">
    <name>Отклонена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ЗаявкаНаРасходованиеДенежныхСредств/Forms/ФормаСпискаДокументов/Module.bsl
&НаСервере
Процедура ИТБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Список.ТекстЗапроса ="ВЫБРАТЬ РАЗЛИЧНЫЕ
|	Заявка.Ссылка КАК Ссылка,
|	Заявка.ПометкаУдаления КАК ПометкаУдаления,
|	Заявка.Номер КАК Номер,
|	Заявка.Дата КАК Дата,
|	Заявка.Проведен КАК Проведен,
|	Заявка.Организация КАК Организация,
|	Заявка.Статус КАК Статус,
|	МАКСИМУМ(ВЫБОР
|			КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты)
|				ТОГДА Заявка.ХозяйственнаяОперацияПоЗарплате
|			ИНАЧЕ Заявка.ХозяйственнаяОперация
|		КОНЕЦ) КАК ХозяйственнаяОперация,
|	Заявка.СуммаДокумента КАК СуммаДокумента,
|	Заявка.Валюта КАК Валюта,
|	Заявка.БанковскийСчет КАК БанковскийСчет,
|	Заявка.Касса КАК Касса,
|	Заявка.ЖелательнаяДатаПлатежа КАК ДатаПлатежа,
|	ВЫБОР
|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
|			ТОГДА Заявка.ПодотчетноеЛицо
|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
|				ИЛИ Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию)
|				ИЛИ Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
|			ТОГДА Заявка.ОрганизацияПолучатель
|		ИНАЧЕ Заявка.Контрагент
|	КОНЕЦ КАК Получатель,
|	Заявка.Контрагент КАК Контрагент,
|	Заявка.Подразделение КАК Подразделение,
|	Заявка.КтоЗаявил КАК Заявитель,
|	Заявка.Представление КАК Представление,
|	Заявка.ПриоритетОплаты КАК ПриоритетОплаты,
|	Заявка.СверхЛимита КАК СверхЛимита,
|	1 КАК КартинкаПриоритета,
|	МИНИМУМ(ВЫБОР
|			КОГДА ЕСТЬNULL(ДенежныеСредства.СуммаОстаток, 0) <= 0
|					И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ПроведеноБанком
|					И Заявка.Проведен
|					И Заявка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
|				ТОГДА ИСТИНА
|			ИНАЧЕ ЛОЖЬ
|		КОНЕЦ) КАК ЗаявкаОплачена,
|	ВЫБОР
|		КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы ЕСТЬ NULL
|			ТОГДА 1
|		КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы
|			ТОГДА 0
|		ИНАЧЕ 1
|	КОНЕЦ КАК ЕстьФайлы,               // begin fix Designer25.10.2021 1:55:02
|	СостоянияЭД.СостояниеЭДО,
|	СостоянияЭД.ПредставлениеСостояния // end fix Designer25.10.2021 1:55:08
|ИЗ
|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваКВыплате.Остатки КАК ДенежныеСредства
|			ПО (ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеПрисоединенныхФайлов
|			ПО Заявка.Ссылка = НаличиеПрисоединенныхФайлов.ОбъектСФайлами
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
|			ПО (СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД   	// begin fix Designer02.10.2022 10:25:48
|			ПО (СостоянияЭД.СсылкаНаОбъект = Заявка.Ссылка)                           	// end fix Designer02.10.2022 10:25:55
|ГДЕ
|	Заявка.Номер <> """"
|
|СГРУППИРОВАТЬ ПО
|	Заявка.Ссылка,
|	Заявка.ПометкаУдаления,
|	Заявка.Номер,
|	Заявка.Дата,
|	Заявка.Проведен,
|	Заявка.Организация,
|	Заявка.Статус,
|	Заявка.СуммаДокумента,
|	Заявка.Валюта,
|	Заявка.БанковскийСчет,
|	Заявка.Касса,
|	Заявка.ЖелательнаяДатаПлатежа,
|	Заявка.Контрагент,
|	Заявка.Подразделение,
|	Заявка.КтоЗаявил,
|	Заявка.Представление,
|	Заявка.СверхЛимита,
|	ВЫБОР
|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
|			ТОГДА Заявка.ПодотчетноеЛицо
|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
|				ИЛИ Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию)
|				ИЛИ Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
|			ТОГДА Заявка.ОрганизацияПолучатель
|		ИНАЧЕ Заявка.Контрагент
|	КОНЕЦ,
|	ВЫБОР
|		КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы ЕСТЬ NULL
|			ТОГДА 1
|		КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы
|			ТОГДА 0
|		ИНАЧЕ 1
|	КОНЕЦ,
|	Заявка.ПриоритетОплаты,       			// begin fix Designer25.10.2021 1:54:26
|	СостоянияЭД.СостояниеЭДО,
|	СостоянияЭД.ПредставлениеСостояния";  	// end fix Designer25.10.2021 1:54:43



КонецПроцедуры


//&НаСервереБезКонтекста
//Процедура ИТБК_СписокПриПолученииДанныхНаСервереВместо(ИмяЭлемента, Настройки, Строки)
//		//Попытка
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
//		|ИЗ
//		|	РегистрНакопления.ДенежныеСредстваКВыплате КАК ДенежныеСредства
//		|ГДЕ
//		|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств В(&МассивЗаявок)
//		|	И ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|	И ВЫБОР
//		|			КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
//		|				ТОГДА ДенежныеСредства.Регистратор.ПроведеноБанком
//		|		КОНЕЦ
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств";
//	
//	Запрос.УстановитьПараметр("МассивЗаявок", Строки.ПОлучитьКлючи());
//	
//	РезультатЗапросаДС = Запрос.Выполнить().Выгрузить();
//	Для каждого Стр Из Строки Цикл
//	
//		СтруктураПоиска = Новый Структура("ЗаявкаНаРасходованиеДенежныхСредств",Стр.Значение.Данные.Ссылка) ;
//	    НайденныйМассив = РезультатЗапросаДС.НайтиСтроки(СтруктураПоиска);
//	Если не НайденныйМассив.Количество() Тогда
//		//ЕстьОплата
//		ФактическаяОплата = Истина;
//	Иначе
//		//нет оплаты
//		Стр.Значение.Оформление["ЗаявкаОплачена"].УстановитьЗначениеПараметра("Текст","");
//		ФактическаяОплата = Ложь;
//	КонецЕсли;
//			Стр.Значение.Оформление["ЗаявкаОплачена"].УстановитьЗначениеПараметра("Текст","");
//	
//	КонецЦикла;

//	//
//	//Исключение
//	//// Вставить содержимое метода.
//	//ПродолжитьВызов();
//	//КонецПопытки;

//КонецПроцедуры
